; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	image3 - mode
	image0 - mode
	GroundStation3 - direction
	GroundStation6 - direction
	Star0 - direction
	GroundStation4 - direction
	Star5 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star5)
	(supports instrument1 image3)
	(supports instrument1 spectrograph4)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 image3)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument5 spectrograph1)
	(supports instrument5 image3)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation6)
	(supports instrument6 thermograph2)
	(supports instrument6 image3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
	(supports instrument7 spectrograph4)
	(supports instrument7 image0)
	(supports instrument7 image3)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image0)
	(supports instrument8 thermograph2)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument9 thermograph2)
	(supports instrument9 spectrograph4)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 Star2)
	(supports instrument10 spectrograph1)
	(supports instrument10 thermograph2)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 Star5)
	(supports instrument11 thermograph2)
	(supports instrument11 image0)
	(calibration_target instrument11 Star1)
	(calibration_target instrument11 Star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite1 Phenomenon7)
	(pointing satellite3 Star12)
	(have_image Phenomenon7 image0)
	(have_image Planet8 image3)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Phenomenon11 image3)
	(have_image Star12 spectrograph4)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 image0)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 11
2. (calibrate satellite3 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 1 of 11
3. (turn_to satellite3 planet14 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet14)
   goals met: 1 of 11
4. (take_image satellite3 planet14 instrument8 image0)
   added: (have_image planet14 image0)
   goals met: 2 of 11
5. (turn_to satellite3 planet13 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet13)
   goals met: 2 of 11
6. (take_image satellite3 planet13 instrument8 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 3 of 11
7. (turn_to satellite3 planet10 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet10)
   goals met: 3 of 11
8. (take_image satellite3 planet10 instrument8 image0)
   added: (have_image planet10 image0)
   goals met: 4 of 11
9. (turn_to satellite3 phenomenon7 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon7)
   goals met: 4 of 11
10. (turn_to satellite1 phenomenon7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 11
11. (turn_to satellite0 star5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star5)
   goals met: 4 of 11
12. (take_image satellite3 phenomenon7 instrument8 image0)
   added: (have_image phenomenon7 image0)
   goals met: 5 of 11
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 11
14. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 5 of 11
15. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 5 of 11
16. (take_image satellite0 planet8 instrument1 image3)
   added: (have_image planet8 image3)
   goals met: 6 of 11
17. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 6 of 11
18. (take_image satellite0 star12 instrument1 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 7 of 11
19. (turn_to satellite0 phenomenon11 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon11)
   goals met: 8 of 11
20. (take_image satellite0 phenomenon11 instrument1 image3)
   added: (have_image phenomenon11 image3)
   goals met: 9 of 11
21. (turn_to satellite3 star9 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star9)
   goals met: 9 of 11
22. (take_image satellite3 star9 instrument8 image0)
   added: (have_image star9 image0)
   goals met: 10 of 11
23. (turn_to satellite3 star12 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star12)
   goals met: 11 of 11
